           
           DISPLAY USER-INPUT
           IF USER-INPUT = "exit"
              DISPLAY "you want to exit"
              GOBACK
           END-IF 
