       01 USER-DB-RECORD.
           05 USER-REC-ID    PIC 9(10).
           05 USER-REC-NAME  PIC X(30).
           05 USER-REC-DOB   PIC X(10).  *> Format: YYYY-MM-DD
